Revit 2027 API
PipePressureDropData.OutsideDiameter Property
 The outside diameter of the pipe. Units: (ft).
Namespace: Autodesk.Revit.DB.Plumbing
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public double OutsideDiameter { get; }
Public ReadOnly Property OutsideDiameter As Double
	Get
public:
property double OutsideDiameter {
	double get ();
}
member OutsideDiameter : float with get
Property Value
Double
See Also
Reference
PipePressureDropData Class
Autodesk.Revit.DB.Plumbing Namespace